var sensC = '天安门运动,法轮功,西藏暴动,六四事件,讨伐中宣部,异议人士,民运人士,64惨案,64时期,64运动,北京风波,火药配方,人体炸弹,人肉炸弹,台独,藏独,圣战组织,轮功,法轮,轮法功,三去车仑,氵去车仑,轮子功,车仑工力,大纪元,退党,集体自杀,爱爱,双飞,3p,约炮,约泡,文爱,图爱,色聊,舔逼,舔b,互舔,野战,女女,拉拉,滚床单,69,群交,上床,一夜情,性福,菊花,群P,轮奸,扣逼,jb,床上,三图,les,419,ons,yue炮,yue泡,约pao,炮约,爱液,按摩棒,暴干,暴奸,屄,肏,被操,被插,被干,逼奸,插暴,操逼,操黑,操烂,肏你,肏死,操死,操我,厕奴,插比,插b,插逼,插阴,潮吹,潮喷,吃精,抽插,扌由插,抽一插,春药,大力抽送,大乳,荡妇,荡女,多人轮,发浪,肥逼,粉穴,干死你,干穴,肛门,黑逼,后庭,后穴,几吧,鸡吧,鸡奸,妓女,集体淫,奸情,叫床,脚交,精液,巨屌,菊门,巨奶,巨乳,菊穴,开苞,口爆,口活,果聊,床友,草穴,口射,口淫,狂操,浪逼,浪妇,浪叫,浪女,聊性,流淫,露b,乱伦,轮暴,轮操,裸陪,买春,母狗,美逼,美穴,秘唇,迷奸,密穴,蜜穴,蜜液,摸奶,摸胸,母奸,奶子,内射,嫩逼,嫩穴,捏弄,炮友,砲友,喷精,强jian,强暴,情色,拳交,全裸,日逼,日烂,肉逼,肉唇,肉洞,肉缝,肉棍,肉茎,肉具,揉乳,肉穴,肉欲,骚逼,骚比,骚女,骚水,骚穴,色逼,色b,射爽,射颜,食精,兽奸,兽交,手淫,兽欲,死逼,套弄,体奸,体位,舔脚,舔阴,文做,吸精,相奸,小逼,小穴,小xue,催情,壮阳,性饥渴,性技巧,性奴,性虐,性息,性欲,胸推,穴口,穴图,颜射,一夜欢,一ye情,阴部,淫荡,阴道,阴阜,淫妇,淫河,阴核,淫叫,阴精,淫液,阴b,应召,幼交,玉穴,原味内衣,援助交际,招鸡,招妓,性伴侣,精子,诱奸,性爱,深穴,sm,小姐,包夜,卖淫,上门服务,裸聊,鸡巴,自慰,强奸,阴茎,阴唇,群交,肛交,口交,女同,逼痒,同性恋,肉棒,乳穴,乳交,打炮,性交,淫水,强歼,乱交,援交,造爱,作爱,做爱,阳具,睾丸,插我,插你,插她,插他,干你,干她,干他,射精,屁眼,阴户,阴门,龟头,阴毛,叫春,狂插,操,么么哒官方,么么哒官方账号,官方小秘书,约会小秘书,钱袋小秘书,wechat,重金求子,银行,账号,汇款,打钱,转账,打款,支付宝,卡号,账号密码,农行,工行,建行,信用卡提现,无抵押贷款,广告代理,借腹生子,代孕妈妈,代生孩子,足球投注,地下钱庄,资金周转,质押贷款,小额贷款,求购,销售,wei信,weixin,微xin,wx,微信,扣扣,qq,加Q,V信,出售,上门,兼职,中介,妇科,男科,整形,收购,全套,价格,咨询,杨生,情趣用品,代购,办理各种,办理票据,办理文凭,办理证书,办证,傻逼,欠干,婊子养的,我日你,我操,爆你菊,操你妈,操你娘,操他妈,日你妈,干你妈,干你娘,娘西皮,狗操,狗杂种,狗日的,操你祖宗,操你全家,操你大爷,妈逼,你妈逼,妈了个逼,狗娘养,贱b,死全家,全家死光,全家不得好死,全家死绝';
var secsB = '天安门运动,法轮功,西藏暴动,六四事件,包夜,卖淫,上门服务,裸聊,鸡巴,自慰,强奸,阴茎,鸡巴,阴唇,群交,肛交,口交,逼痒,肉棒,乳穴,乳交,打炮,性交,淫水,强歼,乱交,援交,造爱,作爱,阴茎,阳具,睾丸,插我,插你,插她,插他,干你,干她,干他,射精,屁眼,阴户,阴门,龟头,阴毛,叫春,狂插,操,讨伐中宣部,异议人士,民运人士,64惨案,64时期,64运动,北京风波,火药配方,人体炸弹,人肉炸弹,台独,藏独,圣战组织,轮功,法轮,轮法功,三去车仑,氵去车仑,轮子功,车仑工力,大纪元,退党,集体自杀,爱爱,双飞,3p,约炮,约泡,文爱,图爱,舔逼,舔b,互舔,野战,女女,拉拉,群交,上床,一夜情,性福,群P,轮奸,扣逼,jb,三图,les,ons,yue炮,yue泡,约pao,炮约,爱液,按摩棒,暴干,暴奸,屄,肏,被操,被插,被干,逼奸,插暴,操逼,操黑,操烂,肏你,肏死,操死,操我,厕奴,插比,插b,插逼,插阴,潮吹,潮喷,吃精,抽插,扌由插,抽一插,春药,大力抽送,大乳,荡妇,荡女,多人轮,发浪,肥逼,粉穴,干死你,干穴,肛门,黑逼,后庭,后穴,几吧,鸡吧,鸡奸,妓女,集体淫,奸情,叫床,脚交,精液,巨屌,菊门,巨奶,巨乳,菊穴,开苞,口爆,口活,果聊,床友,草穴,口射,口淫,狂操,浪逼,浪妇,浪叫,浪女,聊性,流淫,露b,乱伦,轮暴,轮操,裸陪,买春,母狗,美逼,美穴,秘唇,迷奸,密穴,蜜穴,蜜液,摸奶,摸胸,母奸,奶子,内射,嫩逼,嫩穴,捏弄,炮友,砲友,喷精,强jian,强暴,情色,拳交,全裸,日逼,日烂,肉逼,肉唇,肉洞,肉缝,肉棍,肉茎,肉具,揉乳,肉穴,肉欲,骚逼,骚比,骚女,骚水,骚穴,色逼,色b,射爽,射颜,食精,兽奸,兽交,手淫,兽欲,死逼,套弄,体奸,体位,舔脚,舔阴,文做,吸精,相奸,小逼,小穴,小xue,催情,壮阳,性饥渴,性技巧,性奴,性虐,性息,性欲,胸推,穴口,穴图,颜射,一夜欢,一ye情,阴部,淫荡,阴道,阴阜,淫妇,淫河,阴核,淫叫,阴精,淫液,阴b,应召,幼交,玉穴,原味内衣,援助交际,招鸡,招妓,性伴侣,精子,诱奸,性爱,深穴,sm,欠干,婊子养的,我日你,我操,爆你菊,操你妈,操你娘,操他妈,日你妈,干你妈,干你娘,娘西皮,狗操,狗杂种,狗日的,操你祖宗,操你全家,操你大爷,妈逼,你妈逼,妈了个逼,狗娘养,贱b,死全家,全家死光,全家不得好死,全家死绝,1v1视频,v信,兼职,扣扣,肩职,佣金,打字员,打字园,陶寳,網购,诚聘,物疗,卫信,微商,嶶信,裸聊,果聊,一夜情'
//过滤敏感词sens
//@param type表示类型，1表示B类，2表示C类
function fliterSens(str,type){
    if(type == 1){
        sens = secsB.split(',');
    }else if(type == 2){
        sens = sensC.split(',');
    }
    var reg;
    for(var i=0;i<sens.length;i++){
        if(str.indexOf(sens[i]) > -1){
            reg = "/"+sens[i]+"/g";
            str = str.replace(eval(reg),"***");
        }
    }
    return str;
}
